%
% EuroBinCall.m (二項モデルによるヨーロピアンコールオプション価格)
%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 1. パラメータの設定
% 
% S0; 原資産初期値:            sigma; ボラティリティ:        
% r; 無リスク利子率:           rho; 配当率
% T; オプション満期(年):       N; 期間数:   
% K; 行使価格:
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

S0 = 100; sigma = 0.4; r = 0.1; K = 100; T = 3/12; 

rho = 0; 
    % 配当率(配当無しの場合は0).
N = 8;      % 期関数
dt = T/N;   % 各期間の長さ
af = exp((r-rho)*dt); 
    % 配当を考慮した1期間のaccumulation factor

u = exp(sigma*sqrt(dt)); d = 1/u; % 上昇率、および下降率
p = (af-d)/(u-d); q = 1-p;        % リスク中立確率 (p;上昇, q; 下降)

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 2. 原資産二項モデルの計算
% 
% S; 原資産価格行列 (N+1行N+1列)
%    ただし、S(jj,nn)はnn-1ステップにおける上からjj番目のノード
%    における原資産価格
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

S = zeros(N+1,N+1);    

for nn = 1:N+1,
  for jj = 1:nn,
     S(jj,nn)=u^(nn-jj)*d^(jj-1)*S0;
  end
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 3. コールオプション二項モデルの計算
% 
% C; コールオプション価格行列 (N+1行N+1列)
%    ただし、C(jj,nn)はnn-1ステップにおける上からjj番目のノード
%    における価格
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

C = zeros(N+1,N+1);

C(:,N+1) = max(S(:,N+1)-K,0);
for nn = N:-1:1,
  for jj = 1:nn,
     C_e = p*C(jj,nn+1)+q*C(jj+1,nn+1); % リスク中立での1期後の期待値
     C(jj,nn)= exp(-r*dt)*C_e;          % 割引価値の計算
  end
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 4. オプション初期価格の表示と連続時間BS解との比較
% 
% C0;   二項モデルにおけるコールオプション初期価格
% C_bs; ブラックショールズモデルにおけるコールオプション初期価格
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

C0 = C(1,1); 
     % 二項モデルにおけるオプション初期価格
[C_bs,P_bs] = blsprice(S0,K,r,T,sigma,rho);
     % ブラックショールズモデルにおけるオプション初期価格
disp('  二項コール価格 C0 = ');
disp(C0)
disp('  ブラックショールズ価格 C_bs = ');
disp(C_bs)






